#language: ru

@tree

Функционал: Практические задания к Модулю1Пункт1

Как Менеджер я хочу
Проверить корректность расчета суммы документа Заказ при изменении количества или цены.

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка суммы при изменении количества и цены
И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
Тогда открылось окно 'Заказы товаров'
И в таблице "Список" я активизирую поле с именем "Номер"
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Заказ * от *'
И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Bosch15'
*запоминаю параметры для сверки
    И Я запоминаю значение выражения '60,00' в переменную "$Цена$"
	И Я запоминаю значение выражения '200' в переменную "$Количество$"
    И Я запоминаю значение выражения 'Формат($Цена$*$Количество$,"ЧДЦ=2")' в переменную "$СуммаПроверки$"
	*вводим реквизиты
	И я перехожу к следующему реквизиту
	И в таблице "Товары" в поле с именем "ТоварыЦена" я ввожу значение выражения "$Цена$"
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу значение выражения  "$Количество$"
	И в таблице "Товары" я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
*проверяю что сумма стала равной сумме введенных значений
	Тогда таблица "Товары" содержит строки:
			| 'Товар'   | 'Цена'  | 'Количество' | 'Сумма'     |
     		| 'Bosch15' | '$Цена$' | '$Количество$' |'$СуммаПроверки$' |