#language: ru

@tree

Функционал: проверка отчета Остатки

Как администратор  я хочу
сделать проверку отчета Отстатки товаров
чтобы протестировать вариант отчета

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий:проверка отчета Остатки товаров
*Открытие формы отчета
	И В командном интерфейсе я выбираю 'Закупки' 'Остатки товаров'
	Тогда открылось окно 'Остатки товаров (Основной)'
	И в табличном документе 'Результат' я перехожу к ячейке "R1C1"
	И я нажимаю на кнопку с именем 'ФормаСформировать'
*Ожидание прогрузки настроек очтета
	И пауза 20
*Просмотр итогового значения остатка
	И в табличном документе 'Результат' я перехожу к ячейке "R27C3"
	И я нажимаю на кнопку с именем 'ФормаСформировать'
*Проверка итоговой суммы
	И в табличном документе 'Результат' ячейка с адресом 'R27C3' равна '4 577,00'