#language: ru

@tree
@Отчеты
Функционал: тестирование отображения возвратов в отчете D2001 Продажи.

Как Тестировщик я хочу
протестировать отчет D2001 Продажи
чтобы проверить отображение возвратов  

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: проверка отображения возвратов в отчете D2001 Продажи
* запуск и формирование отчета
И В командном интерфейсе я выбираю 'Отчеты' 'D2001 Продажи'
Тогда открылось окно 'D2001 Продажи'
И в табличном документе 'Result' я перехожу к ячейке "R1C1"
И я нажимаю на кнопку с именем 'FormGenerate'
* ожидание заполнения итого по колонке Сумма
И я жду когда в табличном документе "Result" заполнится ячейка "R19C3" в течение 20 секунд
* проверка выводов в отчете 
И Табличный документ "Result" равен макету "МакетМодуль4_П2" по шаблону
И табличный документ "Result" содержит строки из макета "МакетМодуль4_П2" по шаблону
И в табличном документе "Result" ячейка с адресом "R16C3" равна "-*" по шаблону

	



