#language: ru

@tree

Функционал: тестирование полей Заказа покупателя

Как Тестировщик я хочу 
протестировать заполнение полей документа Заказ покупателя: Партнер, Соглашение, блокировку поля Контрагент – в случае, если не выбран Партнер
чтобы убедиться в корректности ввода данных

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: проверка заполнения полей заказа покупателя
* Открытие формы создания заказа покупателя
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы покупателей'
	Тогда открылось окно 'Заказы покупателей'
	И я нажимаю на кнопку с именем 'FormCreate'
	Тогда открылось окно 'Заказ покупателя (создание)'
* Добавление Партнера
	И я нажимаю кнопку выбора у поля с именем "Partner"
	Тогда открылось окно 'Партнеры'
	И в таблице "List" я перехожу к строке:
					| 'Наименование'            |
					| 'Клиент 2 (2 соглашения)' |
	И в таблице "List" я выбираю текущую строку
* Проверка заполнения Партнер
	Тогда элемент формы с именем "Partner" стал равен 'Клиент 2 (2 соглашения)'

//Сценарий: проверка заполнения поля соглашение	
* Выбор соглашения
	И я нажимаю кнопку выбора у поля с именем "Agreement"
	Тогда открылось окно 'Соглашения'
	И в таблице "List" я перехожу к строке:
		| 'Код' | 'Наименование'                                                    |
		| '2'   | 'Индивидуальное соглашение 1 (расчет по соглашениям)' |
	И в таблице "List" я выбираю текущую строку
* Проверка заполнения Соглашение
	И элемент формы с именем 'Agreement' стал равен 'Индивидуальное соглашение 1 (расчет по соглашениям)'


Сценарий: проверка возможности выбора контрагента в случае если не выбран партнер
	И я закрываю все окна клиентского приложения
	* Открытие формы создания заказа покупателя
		И В командном интерфейсе я выбираю 'Продажи' 'Заказы покупателей'
		И я нажимаю на кнопку с именем 'FormCreate'
	* Проверка блокировки поля контрагент (партнер не выбран)
		Когда Проверяю шаги на Исключение:
			|'И из выпадающего списка с именем "LegalName" я выбираю по строке 'Тест клиент 3''|
	* Проверка доступности поля контрагент (партнер выбран)
		И я нажимаю кнопку выбора у поля с именем "Partner"
		И в таблице "List" я перехожу к строке:
			| 'Наименование'            |
			| 'Клиент 2 (2 соглашения)' |
		И в таблице "List" я выбираю текущую строку
		И я нажимаю кнопку выбора у поля с именем "LegalName"
		И в таблице "List" я перехожу к строке:
			| 'Наименование'            |
			| 'Тест клиент 3' |
		И в таблице "List" я выбираю текущую строку
		Тогда элемент формы с именем "LegalName" стал равен 'Тест клиент 3'
				