#language: ru

@tree

Функционал: проверки документа Продажи для задания 3

Как тестировщик я хочу
выполнить полную проверку документа РасходТовара

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание нового документа Продажи
* Открытие раздела Продажи
	И В командном интерфейсе я выбираю 'Продажи' 'Документы продаж'
	Тогда открылось окно 'Документы продаж'
* Создание нового документа Расход товаров
	И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруРасходТовара'
	Тогда открылось окно 'Продажа товара (создание)'
* Заполнение шапки документа
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Магазин "Продукты"'
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Большой'
	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Мелкооптовая'
* Заполнение товарной части
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Торт '
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '10,00'
	И в таблице "Товары" я завершаю редактирование строки
* Запись и проведение документа
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда открылось окно 'Продажа * от *'
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И я закрываю все окна клиентского приложения

Сценарий: Проверка созданного документа Продажи
* Открытие текущего документа
	И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=addc00090faa000111eeac9ed69dcd2f"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
* Проверки
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар' | 'Цена'   | 'Количество' | 'Сумма'    |
		| '1' | 'Торт ' | '250,00' | '10,00'      | '2 500,00' |
	И в таблице 'Товары' поле с именем 'ТоварыСумма' имеет значение '2 500,00'
	И в таблице 'Товары' поле с именем 'ТоварыЦена' имеет значение '250,00'
	И в таблице 'Товары' поле с именем 'ТоварыКоличество' имеет значение '10,00'
	И я запоминаю значение поля "Номер" как "$Номер$"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда не появилось окно предупреждения системы
	И я закрываю все окна клиентского приложения

Сценарий: Проверка документа Продажи при изменении количества и цены
* Внесение изменений в документ
	И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=addc00090faa000111eeac9ed69dcd30"
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '10,00'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2,00'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар' | 'Цена'  | 'Количество' | 'Сумма' |
		| '1' | 'Хлеб'  | '10,00' | '2,00'       | '20,00' |
	И я закрываю все окна клиентского приложения

Сценарий: Проверка движений по регистрам
* Открытие документа продажи и проведение
	И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=addc00090faa000111eeac9ed69dcd2f"
	И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И пауза 5
* проверка значений регистра продаж
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр продаж'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Регистратор' | 'Номер строки' | 'Покупатель'         | 'Сумма'    | 'Товар' | 'Количество' |
		| '*'           | '1'            | 'Магазин "Продукты"' | '2 500,00' | 'Торт ' | '10,00'      |
* Проверка значений регистра взаиморасчетов с контрагентами
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Регистратор' | 'Номер строки' | 'Контрагент'         | 'Сумма'    | 'Валюта' |
		| '*'           | '1'            | 'Магазин "Продукты"' | '2 500,00' | ''       |
* проверка значений регистра товарных запасов
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр товарных запасов'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Регистратор' | 'Номер строки' | 'Склад'   | 'Товар' | 'Количество' |
		| '*'           | '1'            | 'Большой' | 'Торт ' | '10,00'      |
И я закрываю все окна клиентского приложения
	
	Сценарий: Проверка ПФ Расходная товарная накладная
	И Я открываю навигационную ссылку "e1cib/data/Документ.РасходТовара?ref=addc00090faa000111eeac9ed69dcd2f"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
	Тогда открылось окно 'Таблица'
	И в табличном документе 'SpreadsheetDocument' я перехожу к ячейке "R11C5"
	И в табличном документе 'SpreadsheetDocument' ячейка с адресом "R11C5" равна "2 500" по шаблону
	И я закрываю все окна клиентского приложения













	






